Repository: withelm/LGYM-APP-APIv3
Catalog: LgymApi.Resources/Resources/Emails.*.resx
Languages: pl

# TrainingTableHeaderExercise
source: Exercise
pl: Cwiczenie

# TrainingTableHeaderSeries
source: Set
pl: Seria

# TrainingTableHeaderReps
source: Reps
pl: Powt.

# TrainingTableHeaderWeight
source: Weight
pl: Ciezar

# TrainingTableHeaderUnit
source: Unit
pl: Jednostka

# TrainingSeriesLabel
source: Series
pl: Seria

# TrainingRepsLabel
source: Reps
pl: Powt.

# TrainingWeightLabel
source: Weight
pl: Ciezar

# TrainingUnitLabel
source: Unit
pl: Jednostka

# TrainingNoExercises
source: No exercises recorded.
pl: Brak cwiczen.
