Repository: withelm/LGYM-APP-APIv3
Catalog: LgymApi.Resources/Resources/Messages.*.resx
Languages: pl

source: Created
pl: Utworzono

# FieldRequired
source: All fields are required.
pl: Wymagane są wszystkie pola

# ChooseDays
source: You must choose a number of days between 1 and 7.
pl: Wybierz liczbę dni od 1 do 7

source: Updated
pl: Zaktualizowano

# TryAgain
source: An error occurred. Please try again.
pl: Błąd, spróbuj ponownie

source: Deleted.
pl: Usunięto!

# DidntFind
source: Not found.
pl: Nie znaleziono!

# InvalidToken
source: Invalid JWT token.
pl: Nieprawidłowy token JWT

# ExpiredToken
source: Token has expired.
pl: Token wygasł

source: Inputs must be numbers.
pl: Wprowadzone wartości muszą być liczbami

# NameIsRequired
source: Name is required and must contain at least one character.
pl: Nazwa jest wymagana i musi mieć co najmniej jeden znak

# EmailInvalid
source: This email address is not valid.
pl: Ten email jest nieprawidłowy!

# PasswordMin
source: Password must be at least six characters long.
pl: Hasło musi mieć co najmniej sześć znaków

# SamePassword
source: Passwords must be the same.
pl: Hasła muszą być takie same

# UserWithThatName
source: A user with that name already exists.
pl: Istnieje użytkownik o takiej nazwie

# UserWithThatEmail
source: A user with that email already exists.
pl: Istnieje użytkownik z takim adresem email

source: Unauthorized
pl: Brak autoryzacji

source: Forbidden
pl: Brak dostępu

# BodyPartRequired
source: Body part is required.
pl: Partia ciała jest wymagana.

# ExerciseIdRequired
source: Exercise ID is required.
pl: ID ćwiczenia jest wymagane.

# CultureRequired
source: Culture is required.
pl: Kultura jest wymagana.

# SeriesMustBeGreaterThanZero
source: Series must be greater than 0.
pl: Liczba serii musi być większa od 0.

# ExerciseNameRequired
source: Exercise name is required.
pl: Nazwa ćwiczenia jest wymagana.

# PasswordRequired
source: Password is required.
pl: Hasło jest wymagane.

# GymIdRequired
source: Gym ID is required.
pl: ID siłowni jest wymagane.

# PlanDayIdRequired
source: Plan day ID is required.
pl: ID dnia planu jest wymagane.

# DateRequired
source: Date is required.
pl: Data jest wymagana.

# UnitRequired
source: Unit is required.
pl: Jednostka jest wymagana.

# WeightMustBePositive
source: Weight must be a positive number.
pl: Waga musi być liczbą dodatnią.

# RepsMustBePositive
source: Reps must be a positive number.
pl: Liczba powtórzeń musi być dodatnia.

# RepsRequired
source: Reps is required.
pl: Liczba powtórzeń jest wymagana.

# ShareCodeRequired
source: Share code is required.
pl: Kod udostępniania jest wymagany.

# ValueMustBePositive
source: Value must be a positive number.
pl: Wartość musi być liczbą dodatnią.

# TrainingIdRequired
source: Training ID is required.
pl: ID treningu jest wymagane.

# UserIdRequired
source: User ID is required.
pl: ID użytkownika jest wymagane.

# PermissionAdminAccess
source: Admin access
pl: Dostęp administratora

# PermissionManageUserRoles
source: Manage user roles
pl: Zarządzanie rolami użytkowników

# PermissionManageAppConfig
source: Manage app version config
pl: Zarządzanie konfiguracją wersji aplikacji

# PermissionManageGlobalExercises
source: Manage global exercises
pl: Zarządzanie globalnymi ćwiczeniami

# RoleWithThatName
source: A role with that name already exists.
pl: Istnieje rola o takiej nazwie.

# InvalidRoleSelection
source: One or more selected roles are invalid.
pl: Jedna lub więcej wybranych ról jest nieprawidłowa.

# InvalidPermissionClaims
source: One or more selected permission claims are invalid.
pl: Jedno lub więcej wybranych uprawnień jest nieprawidłowe.

# DefaultRoleMissing
source: Default user role configuration is missing.
pl: Brakuje konfiguracji domyślnej roli użytkownika.

# TrainerRoleRequired
source: Trainer role is required.
pl: Wymagana jest rola trenera.

# CannotInviteYourself
source: You cannot invite yourself.
pl: Nie możesz zaprosić samego siebie.

# TraineeAlreadyLinked
source: This trainee is already linked to a trainer.
pl: Ten podopieczny jest już powiązany z trenerem.

# InvitationNoLongerPending
source: Invitation is no longer pending.
pl: Zaproszenie nie jest już oczekujące.

# InvitationExpired
source: Invitation has expired.
pl: Zaproszenie wygasło.

# DashboardPageMustBeGreaterThanZero
source: Page must be greater than 0.
pl: Numer strony musi być większy niż 0.

# DashboardPageRange
source: Page must be between 1 and 21474837.
pl: Numer strony musi mieścić się w zakresie od 1 do 21474837.

# DashboardPageSizeRange
source: Page size must be between 1 and 100.
pl: Rozmiar strony musi mieścić się w zakresie od 1 do 100.

# DashboardSortByInvalid
source: Invalid sortBy value. Allowed: name, createdAt, status.
pl: Nieprawidłowa wartość sortBy. Dozwolone: name, createdAt, status.

# DashboardSortDirectionInvalid
source: Invalid sortDirection value. Allowed: asc, desc.
pl: Nieprawidłowa wartość sortDirection. Dozwolone: asc, desc.

# DashboardStatusInvalid
source: Invalid status value.
pl: Nieprawidłowa wartość status.

# ReportFieldValidationFailed
source: Submitted report fields are invalid.
pl: Przesłane pola raportu są nieprawidłowe.

# ReportRequestNotPending
source: Report request is no longer pending.
pl: Zgłoszenie raportu nie jest już oczekujące.

# ReportRequestExpired
source: Report request has expired.
pl: Termin zgłoszenia raportu minął.
